<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of CocoaDialog.</string>
	<key>Identifier</key>
	<string>com.github.jlrgraham.autopkg.download.CocoaDialog</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>CocoaDialog</string>
		<key>GITHUB_REPO</key>
        <string>mstratman/cocoadialog</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubDownloadsInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>version_regex</key>
                <string>cocoaDialog_(.*).dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
